[
    {
        "id": "js",
        "title": "JavaScript",
        "file": "main.js",
        "concept": "JavaScript (JS) is the world's most popular programming language, used to build interactive web pages. It allows you to update dynamic content without reloading the page, create animations, and handle user events directly in the browser. Moreover, with the support of Node.js, JS can operate on servers, forming the foundation for large applications such as APIs, server-side rendering, and real-time data processing. This is a flexible language suitable for both beginners and experts in the tech industry.",
        "difficulty": "Medium",
        "lessons": 120,
        "students": 1500,
        "reviews": 80,
        "icon": "/image/javascript.ico",
        "code": "function sayHello() {\n    console.log(\"Hello World\");\n}  \n\n sayHello();"
    },
    {   
        "id": "nextjs",
        "title": "Next.js",
        "file": "main.jsx",
        "concept": "Next.js is a leading React framework that enables developers to easily build high-performance static and dynamic web applications. It supports modern features like Server-Side Rendering (SSR), Static Site Generation (SSG), and API Routes, optimizing the user experience. Next.js integrates seamlessly with the React ecosystem, supports SEO, and provides versatile tools for building products quickly and efficiently. It is an ideal choice for large-scale projects requiring reliability and scalability.",
        "difficulty": "Medium - Hard",
        "lessons": 80,
        "students": 500,
        "reviews": 400,
        "icon": "/image/nextjs.ico",
        "code": "import React from 'react';\n\n export default function Home() {\n  return (\n    <div>\n      <h1>Hello, World!</h1>\n  <p>Welcome to your first Next.js app!</p>\n    </div>\n  );\n}"
    },
    {
        "id": "dart",
        "title": "Dart",
        "file": "main.dart",
        "concept": "Dart is a multi-purpose programming language developed by Google, known for building cross-platform web and mobile applications. Combined with Flutter, Dart allows developers to create smooth, high-performance apps for Android, iOS, and even the web. This language features syntax similar to Java or C++ but is more modern, streamlining the app development process. It is an ideal choice for those who want to develop applications quickly and cost-effectively.",
        "difficulty": "Medium",
        "lessons": 70,
        "students": 500,
        "reviews": 350,
        "icon": "/image/dart.svg",
        "code": "void main() {\n  print('Hello, World!');\n}"
    },
    {
        "id": "swift",
        "title": "Swift",
        "file": "ContentView.swift",
        "concept": "Swift is a powerful and easy-to-learn programming language from Apple, designed for building applications across the iOS, macOS, watchOS, and tvOS ecosystems. Swift stands out with its modern syntax, safety features, and high performance, enabling developers to create apps quickly and efficiently. This language is especially popular in the mobile development community, thanks to strong support from Apple and tools like Xcode. Learning Swift is the first step into the world of Apple app development.",
        "difficulty": "Hard",
        "lessons": 90,
        "students": 400,
        "reviews": 200,
        "icon": "/image/swift.ico",
        "code": "import SwiftUI\nstruct ContentView: View {\n    var body: some View {\n        Text(\"Hello, World!\")\n    }\n}\nstruct ContentView_Previews: PreviewProvider {\n    static var previews: some View {\n        ContentView()\n    }\n}"
    },
    {
        "id": "ruby",
        "title": "Ruby",
        "file": "main.rb",
        "concept": "Ruby is a readable, easy-to-learn, and highly flexible programming language, widely recognized thanks to the Ruby on Rails framework. Ruby focuses on simplifying the development process, allowing developers to write code faster and more efficiently. With its natural syntax, Ruby is an excellent choice for beginners or web developers who want to build powerful applications without the need for overly complex code.",
        "difficulty": "Easy",
        "lessons": 60,
        "students": 700,
        "reviews": 300,
        "icon": "/image/ruby.ico",
        "code": "puts 'Hello, World!'"
    }
]
